{
  "language": {
    "code": "ru"
  },
  "welcomePage": {
    "title": "Добро пожаловать!",
    "signIn": "Войти",
    "signUp": "Зарегистрироваться",
    "toMain": "на Главную Страницу",
    "aboutUsTitle": "Наша команда",
    "yuliaName": "Юлия Кузич",
    "yuliaRole": "Инженер-программист",
    "yuliaBio": "Прежде всего, я должна сказать, что у меня нет профильного образования в области ИТ, но в настоящее время я прохожу одни из лучших доступных курсов. Я окончила Брестский технический университет по специальности «Логистика», а также получила степень магистра мировой экономики. Три года работала логистом. Теперь моя цель — стать крутым фронтенд-разработчиком и получить хорошую работу. Мои сильные стороны – ответственность, настойчивость, целеустремленность и работоспособность. На данный момент у меня нет опыта работы в сфере IT, но я очень хочу его получить.",
    "anastasiyaName": "Анастасия Козлова",
    "anastasiyaRole": "Ведущий инженер-программист",
    "anastasiyaBio": "Имея архитектурное образование и большой опыт в цифровом производстве, я началв программировать с написания сценариев JavaScript (JS) для Adobe Illustrator и влюбился в этот процесс. Я решил сменить карьеру и погрузился в JS с помощью школы Rolling Scopes. Я верю, что уникальное сочетание навыков и опыта, которым обладает каждый специалист, может ярко проявить себя на своем месте, и надеюсь найти свое место в сфере информационных технологий.",
    "vyacheslavName": "Рышков Вячеслав",
    "vyacheslavRole": "Инженер-программист",
    "vyacheslavBio": "Моим предыдущим местом работы был горно-обогатительный комбинат, где я последние семь лет проработал дежурным электриком. Имею высшее образование по специальности «Автоматизация технологических процессов и производств». По разным причинам я решил сменить работу и выбрал путь в IT. Поскольку у меня уже был опыт администрирования и продвижения веб-сайтов, разработка Frontend показалась мне наиболее привлекательной. Мне это нравится, и я надеюсь стать квалифицированным специалистом.",
    "aboutProjectTitle": "Описание проекта",
    "projectInfo": "Задача проекта — реализовать интерфейс для работы с GraphQL. Площадка GraphQL — это интерактивный пользовательский интерфейс, в котором вы можете создавать и тестировать запросы, которые хотите отправлять в API GraphQL.",
    "aboutCourseTitle": "Информация о курсе",
    "courseInfo": "RS School — бесплатная образовательная программа, проводимая сообществом разработчиков The Rolling Scopes с 2013 года. В RS School может учиться каждый, независимо от возраста, профессиональной занятости и места жительства. Наставники и тренеры нашей школы — front-end и javascript-разработчики из разных компаний и стран."
  },
  "mainPage": {
    "variables": "Переменные",
    "headers": "Заголовки",
    "docs": {
      "button": "ДОКУМЕНТАЦИЯ",
      "queries": "ЗАПРОСЫ",
      "mutations": "МУТАЦИИ",
      "subscriptions": "ПОДПИСКИ",
      "typeDetails": "СВЕДЕНИЯ О ТИПЕ",
      "arguments": "АРГУМЕНТЫ"
    }
  },
  "header": {
    "welcomePage": "GraphiQL | на Начальную страницу",
    "signOut": "Выход"
  },
  "authorization": {
    "signIn": "Войти",
    "signUp": "Зарегистрироваться",
    "inputsTitle": {
      "email": "Электронная почта: ",
      "password": "Пароль: ",
      "confirmPassword": "Повторите пароль: "
    },
    "errors": {
      "email": {
        "notValid": "Адрес электронной почты недействителен",
        "required": "Поле не должно быть пустым"
      },
      "password": {
        "mustHaveUpperCase": "Пароль должен содержать хотя бы одну заглавную букву",
        "mustHaveLowerCase": "Пароль должен содержать хотя бы одну строчную букву",
        "mustHaveNumber": "Пароль должен содержать хотя бы одно число",
        "mustHaveSpecial": "Пароль должен содержать хотя бы один специальный символ",
        "required": "Поле не должно быть пустым",
        "mustHave6Characters": "Пароль должен содержать не менее 6 символов"
      },
      "confirmPassword": {
        "mustMatch": "Пароли должны совпадать",
        "required": "Поле не должно быть пустым"
      }
    }
  }
}
